% Знайти два останніх елементи списку 
% c(lesson2_task02).
% lesson2_task02:last_2_elements([a, b, c, d, f]).
% {e,f}
% Перше речення зрівнює список рівно з двома елементами
% ([X, Y | []]) і вертає кортеж {X, Y}.
% Друге речення зрівнює будь-які інші списки та рекурсивно визиває себе з хвостом списку поки не знайде (дойде)
% до списку з двома елементами.

-module(lesson2_task02).
-export([last_2_elements/1]).

last_2_elements([X, Y | []]) ->
   {X, Y};
last_2_elements([_ | Rest]) ->
    last_2_elements(Rest).